Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/ПроведениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПрограммыОбученияСУО</name>
  <basedOn>Catalog.КаталогПрограммОбученияСУО</basedOn>
  <registerRecords>InformationRegister.ОткрытыеПрограммыОбученияСУО</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>БезСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытаяПрограмма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОткрытойПрограммыДляУчастника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросНаОбучение</name>
    <type>
      <types>DocumentRef.ЗапросНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ОткрытыеПрограммыОбученияСУО/ОткрытыеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОткрытыеПрограммыОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроведениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДокументыТребующиеПерепроведенияСУО/ДокументыТребующиеПерепроведенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыТребующиеПерепроведенияСУО</name>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗаписиДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьПодчиненныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПовтора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПроведенияОбъектовСУО/СтатусыПроведенияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроведенияОбъектовСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПрохождениеПрограммыОбученияСУО/ПрохождениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеПрограммыОбученияСУО</name>
  <registerRecords>InformationRegister.ПрохожденияПрограммОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.РасписаниеПрограммОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиПрограммОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <comment>Учебная группа, в рамках которой пользователь проходит Проведение программы обучения.</comment>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Перем ВозможныеУчастники; // Документы "ПрохождениеПрограммыОбученияСУО" участников мероприятия.

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// {{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КаталогПрограммОбученияСУО") Тогда
		// Заполнение шапки
		ПрограммаОбучения = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	// }}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверяем основные реквизиты
	
	Если БезСценария Тогда
		
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда
			
			Текст = НСтр("ru = 'Укажите наименование программы обучения'");
			Поле = "Наименование";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);			
			
		КонецЕсли;		
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ПрограммаОбучения) Тогда
			
			Текст = НСтр("ru = 'Укажите программу обучения'");
			Поле = "ПрограммаОбучения";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);			
			
		КонецЕсли;		
		
	КонецЕсли;	
	
	// Проверяем корректность дат
		
	Если ОткрытаяПрограмма Тогда // Открытое
		
		Если ЗначениеЗаполнено(ДатаОткрытияЗаписи)
			И НЕ ЗначениеЗаполнено(ДатаЗакрытияЗаписи) Тогда
			
			Текст = НСтр("ru = 'Укажите дату закрытия записи'");
			Поле = "ДатаЗакрытияЗаписи";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДатаОткрытияЗаписи)
			И ЗначениеЗаполнено(ДатаЗакрытияЗаписи) Тогда
			
			Текст = НСтр("ru = 'Укажите дату открытия записи'");
			Поле = "ДатаОткрытияЗаписи";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаОткрытияЗаписи)
			И ЗначениеЗаполнено(ДатаЗакрытияЗаписи)
			И ДатаЗакрытияЗаписи < ДатаОткрытияЗаписи Тогда
			
			Текст = НСтр("ru = 'Дата закрытия записи на мероприятие не может быть меньше даты открытия записи на мероприятие'");
			Поле = "ДатаЗакрытияЗаписи";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;

	// Учебные группы
	
	Если ОбщегоНазначенияСУКлиентСервер.ЕстьСовпаденияВКоллекцииЗначений(УчебныеГруппы, "УчебнаяГруппа") Тогда
		Текст = НСтр("ru = 'Укажите различные учебные группы'");
		Поле = "УчебныеГруппы";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Если НЕ ОткрытаяПрограмма Тогда
		ТребуетсяЗаявка = Ложь;
		УчебныеГруппы.Очистить();
	КонецЕсли;
	
	Если ОткрытоДляВсех Тогда
		УчебныеГруппы.Очистить();
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДатаСеанса();
	
	ДополнительныеСвойства.Вставить("СоздатьАвтоматическуюРассылку", Ложь);
		
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ Проведен Тогда
		ДополнительныеСвойства.СоздатьАвтоматическуюРассылку = Истина;	
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ОткрытаяПрограмма Тогда
		ДополнительныеСвойства.СоздатьАвтоматическуюРассылку = Истина;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
 	
	Движения.ОткрытыеПрограммыОбученияСУО.Записывать  = Истина;
		
	Если Статус <> Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
	
		// ОткрытоеОбучениеСУО
		
		Если ОткрытаяПрограмма Тогда
		
			ВозможныеУчастники = ПолучитьВозможныхУчастников();

			Для каждого Строка Из ВозможныеУчастники Цикл
			
				Движение = Движения.ОткрытыеПрограммыОбученияСУО.Добавить();
				
				Движение.Пользователь                = Строка.Пользователь;
				Движение.ПроведениеПрограммыОбучения = Ссылка;
				
				Движение.ДатаОткрытияЗаписи          = ДатаОткрытияЗаписи;
				Движение.ДатаЗакрытияЗаписи          = ДатаЗакрытияЗаписи;
				Движение.ТребуетсяЗаявка             = ТребуетсяЗаявка;
				Движение.ОткрытоДляРуководителей     = ОткрытоДляРуководителей;
			
			КонецЦикла;
		
		КонецЕсли;

	КонецЕсли;
		
	Движения.Записать();
	
	Если Статус <> Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
				
		// Зачисляем пользователей на мероприятия программы обучения
		
		ЗачислитьПользователейНаОбучения();
		
		// Рассылки
		
		Если ДополнительныеСвойства.Свойство("СоздатьАвтоматическуюРассылку")
			И ДополнительныеСвойства.СоздатьАвтоматическуюРассылку Тогда
			
			ВозможныеУчастники = Неопределено;
			
			Если ОткрытаяПрограмма Тогда
				ВозможныеУчастники = ПолучитьВозможныхУчастников();
			КонецЕсли;
			
			УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ЭтотОбъект, ВозможныеУчастники);

		КонецЕсли;			
		
	КонецЕсли;
	
	ОбновитьПодчиненныеДокументы(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбновитьПодчиненныеДокументы(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбновитьПодчиненныеДокументы(РежимЗаписи)
		
	ОбновлятьПодчиненныеДокументы = УправлениеОбучениемСУО.МожноОбновлятьПодчиненныеДокументы(ЭтотОбъект);
	ЭтоИнтерактивнаяЗапись = ДополнительныеСвойства.Свойство("ЭтоИнтерактивнаяЗапись") И ДополнительныеСвойства.ЭтоИнтерактивнаяЗапись;
	
	Запрос = Новый Запрос;
	
	Если ОбновлятьПодчиненныеДокументы Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрохождениеПрограммыОбученияСУО.Ссылка
			|ИЗ
			|	Документ.ПрохождениеПрограммыОбученияСУО КАК ПрохождениеПрограммыОбученияСУО
			|ГДЕ
			|	ПрохождениеПрограммыОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ПрохождениеПрограммыОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения";
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрохождениеПрограммыОбученияСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПрохождениеПрограммыОбученияСУО КАК ПрохождениеПрограммыОбученияСУО
			|ГДЕ
			|	ПрохождениеПрограммыОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ПрохождениеПрограммыОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
			|	И ПрохождениеПрограммыОбученияСУО.Проведен = ЛОЖЬ";		
		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", Ссылка);

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи, РежимЗаписи, ЭтоИнтерактивнаяЗапись, 3, Ссылка);
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗачислитьПользователейНаОбучения()
	
	ТаблицаМероприятийПрограммыОбучения = Документы.ПроведениеПрограммыОбученияСУО.ПроведенияОбучения(Ссылка);
	ТаблицаУчастниковПрограммыОбучения  = Документы.ПроведениеПрограммыОбученияСУО.ПрохожденияПрограммыОбучения(Ссылка);
	МассивПроведенийОбучения = ТаблицаМероприятийПрограммыОбучения.ВыгрузитьКолонку("ПроведениеОбучения");
	ТаблицаПрохожденийОбучений = Документы.ПроведениеОбученияСУО.ПрохожденияОбучения(МассивПроведенийОбучения, Ложь);
	ЭтоИнтерактивнаяЗапись = ДополнительныеСвойства.Свойство("ЭтоИнтерактивнаяЗапись") И ДополнительныеСвойства.ЭтоИнтерактивнаяЗапись;
	
	Для каждого СтрокаУПО Из ТаблицаУчастниковПрограммыОбучения Цикл
		Для каждого СтрокаМПО Из ТаблицаМероприятийПрограммыОбучения Цикл
			Если НЕ СтрокаМПО.Проведен Тогда
				Продолжить;
			КонецЕсли;
			СтрокиТПО = ТаблицаПрохожденийОбучений.НайтиСтроки(Новый Структура("ПроведениеОбучения, Пользователь", СтрокаМПО.ПроведениеОбучения, СтрокаУПО.Пользователь));
			Если СтрокиТПО.Количество() = 0 Тогда
				УправлениеОбучениемСУО.ЗачислитьУчастникаНаОбучение(СтрокаМПО.ПроведениеОбучения,,СтрокаУПО.Пользователь,СтрокаУПО.УчебнаяГруппа,,,,,,ЭтоИнтерактивнаяЗапись,Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВозможныхУчастников()
	
	Если ВозможныеУчастники = Неопределено Тогда
		Возврат Документы.ПроведениеПрограммыОбученияСУО.ВозможныеУчастникиПрограммыОбучения(Ссылка);
	Иначе
		Возврат ВозможныеУчастники;
	КонецЕсли;
	
КонецФункции

#КонецОбласти


#КонецЕсли
